content/roam/20220406134513-veos_adp.org
:properties:
:id:       59bd937c-b70b-4546-bb0b-98d2215737d8
:end:
#+title: veos-adp

[[./20211012160401-veos_production_plan.org][veos-production-plan]]

* communication
** online (remote-can)
*** uploading
*** downloading
** offline (cloud offline data)?
*** database search interface (es)
**** only search and get record
** cloud deployment?
** data interface [[./20220408125710-veos_adp_training_data_interface.org][veos adp training data interface]]

* vehicles
** dev-vb
** 3 test-vb
* program management:

** who makes decision?
*** who has sense?
*** many decision made to stop the show, has impact on delaying the milestone.
*** technical decision: linux/windows, web requests not available on windows, why?
* remotecan client
** delivery insufficiency
*** poor documentation
**** class method not documented.
**** no why and how
**** diagram low quality
*** naming confusing
- "1s" vs "ls",
- "delay" as "dalay",
- "reson?",
- "pedal | brake?" --> "thrust | brake"
- meaningless value for gears 0,1,2,3; why not p r n d?
*** create a module, almost no test for delivery and expect client to test
**** almost no unit test
***** which test case? which unit tests?
****** test result ok with server not response!
****** test result ok with wrong json message!
****** transmission fail
****** data fail
******* json object need metadata to have its own custom class for serialization and deserialization
******* metadata: type
******* required field
******* optional field
******* length
****** upload fail
****** download fail
******* no confirmation of whether vehicle side received the same data. no check. ust send sucess!!!
****** server pending
