docs/roam/20220406134513-veos_adp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-adp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">veos-adp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3090c48">communication</a>
<ul>
<li><a href="#org768692d">online (remote-can)</a>
<ul>
<li><a href="#org671f9fc">uploading</a></li>
<li><a href="#orge139553">downloading</a></li>
</ul>
</li>
<li><a href="#org4ef6aeb">offline (cloud offline data)?</a>
<ul>
<li><a href="#org833c943">database search interface (es)</a></li>
</ul>
</li>
<li><a href="#orga517c15">cloud deployment?</a></li>
<li><a href="#org253deca">data interface veos adp training data interface</a></li>
</ul>
</li>
<li><a href="#org8a71b97">vehicles</a>
<ul>
<li><a href="#orgd26f06c">dev-vb</a></li>
<li><a href="#org3e008a1">3 test-vb</a></li>
</ul>
</li>
<li><a href="#orgb6de021">program management:</a>
<ul>
<li><a href="#org734daf4">who makes decision?</a>
<ul>
<li><a href="#org28104b2">who has sense?</a></li>
<li><a href="#org4e7ec95">many decision made to stop the show, has impact on delaying the milestone.</a></li>
<li><a href="#org26e394b">technical decision: linux/windows, web requests not available on windows, why?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org03f4a30">remotecan client</a>
<ul>
<li><a href="#org7c1a4c3">delivery insufficiency</a>
<ul>
<li><a href="#orgdca44fc">poor documentation</a></li>
<li><a href="#orgf222b48">naming confusing</a></li>
<li><a href="#org723d711">create a module, almost no test for delivery and expect client to test</a></li>
<li><a href="#org84d673d">poor acceptance of requirements</a></li>
<li><a href="#orgadb4b20">why sending unnecessary redundant data (consumption list)?</a></li>
<li><a href="#orgfd80d4b">"dalay"? method? review?, who is using?</a></li>
<li><a href="#org441af7c">what is the meaning of "alignment（对齐）"</a></li>
<li><a href="#org8d9e1b5">gears dimension? [2x2]?</a></li>
<li><a href="#orge882bc9">timestamp definition, when(被收到的时间戳?)?</a></li>
<li><a href="#org0b80ddf">what does delay mean? estimation method?</a></li>
<li><a href="#orgf08db25">granularity 1s? should be able to get smaller granularity!</a></li>
<li><a href="#org0f5236b">what does "current<sub>zoomed</sub>" mean? method? need raw data!</a></li>
<li><a href="#org4cdbecb">raw data : tuple with every timestamp, if not available use null!</a></li>
<li><a href="#orge7096f8">api no return : black holes! (return status and the changes)</a></li>
<li><a href="#orga294585">failed test result return ok/done.</a></li>
<li><a href="#orgb6e2324">flashing dangerous parameter onto the vehicle without testing！</a></li>
<li><a href="#org5af5532">testing without knowing what is doing (which vehicle is flashing!)</a></li>
<li><a href="#org1f98e68">chaotic imports no isort!</a></li>
<li><a href="#orgada2a39">everytime huge chaotic code changes</a></li>
<li><a href="#orga30b037">chaotic documentation</a></li>
<li><a href="#org9df4622">cannot use directly</a></li>
<li><a href="#org0da506c">no confirm of changing!</a></li>
<li><a href="#org4daf4a0">no design, no architecture, no production level</a></li>
<li><a href="#org7ce3fbe">api design: flashing return error code 3?!</a></li>
<li><a href="#org2d53637">api unstable: cannot flashing!</a></li>
<li><a href="#org83e93f0">todo debug 1000, 1002, empty code {} oss insufficiency</a></li>
<li><a href="#orgdde24f7">todo get &amp; send in duplex mode</a></li>
<li><a href="#org2bf7bb4">poor response (own code response 2 days!)</a></li>
</ul>
</li>
<li><a href="#orgeedaa37">fixed url for server?</a></li>
<li><a href="#orgfb07473">need fake json data server like jsonplaceholder.typicode.com</a></li>
<li><a href="#org9957f65">need timestamps</a></li>
<li><a href="#org233d440">streaming requests</a></li>
<li><a href="#orga9ae504">session for higher efficiency</a></li>
<li><a href="#org2d14fb6">design goal &#x2013;&gt; understand deviation &#x2013;&gt; need verify &#x2013;&gt; performance checking</a></li>
<li><a href="#orge498b3b">todo <b>issues</b> improvements:</a>
<ul>
<li><a href="#orgbd88373">need streaming interface</a></li>
<li><a href="#orgc168e3d">need asynchronous download and upload</a></li>
<li><a href="#orgf105fb6">upload need more status: start/stop/interrupt eos mode,</a></li>
<li><a href="#orgea0defb"><b><b>use rpc instead of rest api</b></b></a></li>
</ul>
</li>
<li><a href="#org3d00920">product branch</a></li>
</ul>
</li>
<li><a href="#org36457bb">tbox</a>
<ul>
<li><a href="#org4eec228">wiring</a>
<ul>
<li><a href="#orgacd369b">can<sub>activate</sub> one light?</a></li>
<li><a href="#org0ba7b59">no calibration can?</a></li>
</ul>
</li>
<li><a href="#org9222c1b">can<sub>driver</sub><sub>node</sub> rebuild? observation values ok?</a></li>
<li><a href="#orgee927db">pm 21 rows &#x2013;&gt; 14 rows? row coordinates?</a></li>
<li><a href="#org9f468f5">flashing</a>
<ul>
<li><a href="#org86b5fbb">upload?</a></li>
<li><a href="#orgb5cc6d8">download?</a></li>
<li><a href="#org3088fe2">diff on/off? meaning?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf961355">cloud</a>
<ul>
<li><a href="#org949ee83">task</a>
<ul>
<li><a href="#org5c1a566">pre-requisite</a></li>
<li><a href="#org62e1685">veos deployment (pip pip+git install, mypy, poetry, )</a></li>
<li><a href="#org19c70ea">veos functional test (remotecan, data pool)</a></li>
</ul>
</li>
<li><a href="#org8450fce">cloud problem</a>
<ul>
<li><a href="#org70b4137">connection</a></li>
<li><a href="#orgf5598d9">docker?</a></li>
<li><a href="#org02b7a43">baiduyun account, profile setting</a></li>
<li><a href="#org3391173">pip</a></li>
<li><a href="#orgeee07d5">not doing own duties</a></li>
<li><a href="#org89f3691">vbu software not confirmed</a></li>
<li><a href="#orgcdc2dac">instruction? handbook? (baidubce?, github? pytorch!)</a></li>
<li><a href="#orgc1fe9ea">least surprise? (low efficiency, poor maturity)</a></li>
</ul>
</li>
<li><a href="#orgc88839e">database</a>
<ul>
<li><a href="#org530312d">data warehouse</a></li>
<li><a href="#orge9e0e97">time series support for databse (timestamp, efficient indexing)</a></li>
<li><a href="#org3b70589"><b>automatic choose collection based on meta data</b></a></li>
<li><a href="#org661cdd2">serialization support for pandas dataframe and numpy array, python objects, compression</a></li>
<li><a href="#orgeb9b6c8">data versioning, snapshots, chunking, ttl</a></li>
<li><a href="#org591b589">update records with new features (mongodb 6.0, for mongodb&lt;6.0 only appending)</a></li>
<li><a href="#org224bdcc">tracking changes over time</a></li>
<li><a href="#orgecff99e">user, user library account management</a></li>
<li><a href="#org5fe8a5a">version-, tick-, chunkstore, bsonstore</a></li>
<li><a href="#org1a3273d">working with large data, lazy loading</a></li>
<li><a href="#org5a3037b">prevent unindexed/unsharded collections</a></li>
<li><a href="#org8e0d574">thread safety?</a></li>
<li><a href="#org0639c68">exception handling (collection)</a></li>
<li><a href="#orgddba7ad">apache arrow for in memory analytics (pymongoarrow)</a></li>
<li><a href="#org8d03621">multiple database with different unit lengths.</a></li>
<li><a href="#orgc8a815d">no configures in the database document/ in application configuration</a></li>
<li><a href="#orgd0c56b0">maintaining, porting, searching, indexing, compatibility?</a></li>
<li><a href="#org7172352">variant metadata</a></li>
<li><a href="#orga27060f">todo data warelake design</a></li>
</ul>
</li>
<li><a href="#org1231945">dvc ml-version-control</a></li>
<li><a href="#org5ebd0fe">truss server for prediction</a></li>
<li><a href="#orgb25764d">basic function</a></li>
<li><a href="#orgeadd3f1">saftety function</a></li>
<li><a href="#org77c94b5">algorithms verficatioin</a></li>
</ul>
</li>
<li><a href="#org164ba03">safety</a>
<ul>
<li><a href="#org25e46bd">communication (cybersecurity, data safety)</a></li>
<li><a href="#orgaa96d62">actor</a></li>
<li><a href="#org95c8fe6">observation (data safety)</a></li>
</ul>
</li>
<li><a href="#orgab1aa0c">test issue</a>
<ul>
<li><a href="#orgdba0904">design sucks, cannot meet requirements</a></li>
<li><a href="#orgc4f250b">quality sucks, oss not sufficient &#x2013;&gt; intest interference? why?</a></li>
<li><a href="#orgc4d8348">database drops, ridiculous</a></li>
<li><a href="#org1e5a129">deadend everywhere</a></li>
<li><a href="#org43a6d11">not telling truth</a></li>
<li><a href="#org26ced23">no test before application, alarming!</a>
<ul>
<li><a href="#org604339f">all problems on the final applications</a></li>
<li><a href="#org99d139c">persistency, availability</a></li>
<li><a href="#org4a01966">not knowning service is available! everyday checking!!!</a></li>
<li><a href="#org21be839">cannot continue test</a></li>
</ul>
</li>
<li><a href="#orgd7ab54e">firmware version, no one cares, which one should be used?!</a>
<ul>
<li><a href="#orge464db4">alarmed but no response</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="./20211012160401-veos_production_plan.html">veos-production-plan</a>
</p>

<div id="outline-container-org3090c48" class="outline-2">
<h2 id="org3090c48">communication</h2>
<div class="outline-text-2" id="text-org3090c48">
</div>
<div id="outline-container-org768692d" class="outline-3">
<h3 id="org768692d">online (remote-can)</h3>
<div class="outline-text-3" id="text-org768692d">
</div>
<div id="outline-container-org671f9fc" class="outline-4">
<h4 id="org671f9fc">uploading</h4>
</div>
<div id="outline-container-orge139553" class="outline-4">
<h4 id="orge139553">downloading</h4>
</div>
</div>
<div id="outline-container-org4ef6aeb" class="outline-3">
<h3 id="org4ef6aeb">offline (cloud offline data)?</h3>
<div class="outline-text-3" id="text-org4ef6aeb">
</div>
<div id="outline-container-org833c943" class="outline-4">
<h4 id="org833c943">database search interface (es)</h4>
<div class="outline-text-4" id="text-org833c943">
</div>
<ul class="org-ul">
<li><a id="org62c3076"></a>only search and get record<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga517c15" class="outline-3">
<h3 id="orga517c15">cloud deployment?</h3>
</div>
<div id="outline-container-org253deca" class="outline-3">
<h3 id="org253deca">data interface <a href="./20220408125710-veos_adp_training_data_interface.html">veos adp training data interface</a></h3>
</div>
</div>

<div id="outline-container-org8a71b97" class="outline-2">
<h2 id="org8a71b97">vehicles</h2>
<div class="outline-text-2" id="text-org8a71b97">
</div>
<div id="outline-container-orgd26f06c" class="outline-3">
<h3 id="orgd26f06c">dev-vb</h3>
</div>
<div id="outline-container-org3e008a1" class="outline-3">
<h3 id="org3e008a1">3 test-vb</h3>
</div>
</div>
<div id="outline-container-orgb6de021" class="outline-2">
<h2 id="orgb6de021">program management:</h2>
<div class="outline-text-2" id="text-orgb6de021">
</div>
<div id="outline-container-org734daf4" class="outline-3">
<h3 id="org734daf4">who makes decision?</h3>
<div class="outline-text-3" id="text-org734daf4">
</div>
<div id="outline-container-org28104b2" class="outline-4">
<h4 id="org28104b2">who has sense?</h4>
</div>
<div id="outline-container-org4e7ec95" class="outline-4">
<h4 id="org4e7ec95">many decision made to stop the show, has impact on delaying the milestone.</h4>
</div>
<div id="outline-container-org26e394b" class="outline-4">
<h4 id="org26e394b">technical decision: linux/windows, web requests not available on windows, why?</h4>
</div>
</div>
</div>
<div id="outline-container-org03f4a30" class="outline-2">
<h2 id="org03f4a30">remotecan client</h2>
<div class="outline-text-2" id="text-org03f4a30">
</div>
<div id="outline-container-org7c1a4c3" class="outline-3">
<h3 id="org7c1a4c3">delivery insufficiency</h3>
<div class="outline-text-3" id="text-org7c1a4c3">
</div>
<div id="outline-container-orgdca44fc" class="outline-4">
<h4 id="orgdca44fc">poor documentation</h4>
<div class="outline-text-4" id="text-orgdca44fc">
</div>
<ul class="org-ul">
<li><a id="orgd37dfa9"></a>class method not documented.<br /></li>
<li><a id="org59bb1a4"></a>no why and how<br /></li>
<li><a id="orgf05fd6d"></a>diagram low quality<br /></li>
</ul>
</div>
<div id="outline-container-orgf222b48" class="outline-4">
<h4 id="orgf222b48">naming confusing</h4>
<div class="outline-text-4" id="text-orgf222b48">
<ul class="org-ul">
<li>"1s" vs "ls",</li>
<li>"delay" as "dalay",</li>
<li>"reson?",</li>
<li>"pedal | brake?" &#x2013;&gt; "thrust | brake"</li>
<li>meaningless value for gears 0,1,2,3; why not p r n d?</li>
</ul>
</div>
</div>
<div id="outline-container-org723d711" class="outline-4">
<h4 id="org723d711">create a module, almost no test for delivery and expect client to test</h4>
<div class="outline-text-4" id="text-org723d711">
</div>
<ul class="org-ul">
<li><a id="org0448f4a"></a>almost no unit test<br />
<ul class="org-ul">
<li><a id="orgd4268c1"></a>which test case? which unit tests?<br />
<ul class="org-ul">
<li><a id="org01fa92e"></a>test result ok with server not response!<br /></li>
<li><a id="org72ed787"></a>test result ok with wrong json message!<br /></li>
<li><a id="orgcc61a36"></a>transmission fail<br /></li>
<li><a id="orga0586f9"></a>data fail<br />
<ul class="org-ul">
<li><a id="org9c73cd0"></a>json object need metadata to have its own custom class for serialization and deserialization<br /></li>
<li><a id="org8c31153"></a>metadata: type<br /></li>
<li><a id="org1064bf3"></a>required field<br /></li>
<li><a id="org76b58bb"></a>optional field<br /></li>
<li><a id="orgaf6b542"></a>length<br /></li>
</ul>
</li>
<li><a id="org5d2de57"></a>upload fail<br /></li>
<li><a id="orgc803617"></a>download fail<br />
<ul class="org-ul">
<li><a id="org64cfcdd"></a>no confirmation of whether vehicle side received the same data. no check. ust send sucess!!!<br /></li>
</ul>
</li>
