content/roam/20220406134513-veos_adp.org
***** not working under windows
***** test incomplete without server (windows problem)
***** test for only a method, not for class
**** test output not aligned
**** test_case names implies nothting
*** poor acceptance of requirements
**** documentation is the schema, need contract.
*** why sending unnecessary redundant data (consumption list)?
*** "dalay"? method? review?, who is using?
*** what is the meaning of "alignment（对齐）"
**** if not aligned, padding with null!
*** gears dimension? [2x2]?
*** timestamp definition, when(被收到的时间戳?)?
*** what does delay mean? estimation method?
*** granularity 1s? should be able to get smaller granularity!
*** what does "current_zoomed" mean? method? need raw data!
*** raw data : tuple with every timestamp, if not available use null!
*** api no return : black holes! (return status and the changes)
*** failed test result return ok/done.
*** flashing dangerous parameter onto the vehicle without testing！
*** testing without knowing what is doing (which vehicle is flashing!)
*** chaotic imports no isort!
*** everytime huge chaotic code changes
*** chaotic documentation
*** cannot use directly
*** no confirm of changing!
*** no design, no architecture, no production level
**** code not maintainable
**** no exception handling
**** no timestamp hanlding
**** typos everywhere
**** not pytest ready
**** false claims
**** naming/api chaotic
**** terrible documentation/coding styles (no black, isort etc.)
**** not familiar with mongodb
*** api design: flashing return error code 3?!
*** api unstable: cannot flashing!
*** todo debug 1000, 1002, empty code {} oss insufficiency
*** todo get & send in duplex mode
*** poor response (own code response 2 days!)

** fixed url for server?
** need fake json data server like jsonplaceholder.typicode.com
** need timestamps
** streaming requests
** session for higher efficiency
** design goal --> understand deviation --> need verify --> performance checking
** todo *issues* improvements:
*** need streaming interface
**** with mode switch to turn on and off
**** need full observation based on incessant frames of a full episode
*** need asynchronous download and upload
**** usual way of remote interaction to handle delay, interrupt, preemtpion
**** flexible, robust
*** upload need more status: start/stop/interrupt eos mode,
*** **use rpc instead of rest api**
** product branch


[[./20220420093028-veos_adp_plan.org][veos-adp-plan]]
* tbox
** wiring
*** can_activate one light?
*** no calibration can?
** can_driver_node rebuild? observation values ok?
** pm 21 rows --> 14 rows? row coordinates?
** flashing
*** upload?
*** download?
*** diff on/off? meaning?
* cloud
** task
*** pre-requisite
**** cloud platform test (connection ssh login, python, linux usergroup, docker install, pyenv configuration, ide )
**** issue fixing
**** dockerfile
**** mypy
**** kubernetes deployment test
**** fortinet install and ethernet test, functional test
*** veos deployment (pip pip+git install, mypy, poetry, )
*** veos functional test (remotecan, data pool)
** cloud problem
*** connection
**** install, github, apt-source, pytorch, tensorflow, nvidia overall
**** internal repo? gitlab.newrizon.work?
**** install package by copy not working
*** docker?
**** dockerfile in the project, install?
**** dockerfile, （kubernetes interface）， install source/pip
*** baiduyun account, profile setting
**** ssh
**** options: pip
**** dns, vpn /ssh reverse tunnel?
**** pyenv?
*** pip
**** git+https://${}:${}gitlab@newrizon.work/ai/drl-carla-manual.git@{realese2}
**** priviate pip repo
*** not doing own duties
**** own container build issue
**** very old git (even in docker reinstalled)
**** not following instructions, deliberately asking irrelevant questions
**** no testing, all integration test by apps!
***** all issues found by apps, not integration test, no module test
***** issues found, no progress
