docs/roam/20220406134513-veos_adp.html
<li><a id="org07b5b2f"></a>server pending<br /></li>
</ul>
</li>
<li><a id="org2ecd0c6"></a>not working under windows<br /></li>
<li><a id="org24d1015"></a>test incomplete without server (windows problem)<br /></li>
<li><a id="org7d198fa"></a>test for only a method, not for class<br /></li>
</ul>
</li>
<li><a id="org1182555"></a>test output not aligned<br /></li>
<li><a id="orgea5dc1f"></a>test<sub>case</sub> names implies nothting<br /></li>
</ul>
</div>
<div id="outline-container-org84d673d" class="outline-4">
<h4 id="org84d673d">poor acceptance of requirements</h4>
<div class="outline-text-4" id="text-org84d673d">
</div>
<ul class="org-ul">
<li><a id="org12f4b23"></a>documentation is the schema, need contract.<br /></li>
</ul>
</div>
<div id="outline-container-orgadb4b20" class="outline-4">
<h4 id="orgadb4b20">why sending unnecessary redundant data (consumption list)?</h4>
</div>
<div id="outline-container-orgfd80d4b" class="outline-4">
<h4 id="orgfd80d4b">"dalay"? method? review?, who is using?</h4>
</div>
<div id="outline-container-org441af7c" class="outline-4">
<h4 id="org441af7c">what is the meaning of "alignment（对齐）"</h4>
<div class="outline-text-4" id="text-org441af7c">
</div>
<ul class="org-ul">
<li><a id="orga873a89"></a>if not aligned, padding with null!<br /></li>
</ul>
</div>
<div id="outline-container-org8d9e1b5" class="outline-4">
<h4 id="org8d9e1b5">gears dimension? [2x2]?</h4>
</div>
<div id="outline-container-orge882bc9" class="outline-4">
<h4 id="orge882bc9">timestamp definition, when(被收到的时间戳?)?</h4>
</div>
<div id="outline-container-org0b80ddf" class="outline-4">
<h4 id="org0b80ddf">what does delay mean? estimation method?</h4>
</div>
<div id="outline-container-orgf08db25" class="outline-4">
<h4 id="orgf08db25">granularity 1s? should be able to get smaller granularity!</h4>
</div>
<div id="outline-container-org0f5236b" class="outline-4">
<h4 id="org0f5236b">what does "current<sub>zoomed</sub>" mean? method? need raw data!</h4>
</div>
<div id="outline-container-org4cdbecb" class="outline-4">
<h4 id="org4cdbecb">raw data : tuple with every timestamp, if not available use null!</h4>
</div>
<div id="outline-container-orge7096f8" class="outline-4">
<h4 id="orge7096f8">api no return : black holes! (return status and the changes)</h4>
</div>
<div id="outline-container-orga294585" class="outline-4">
<h4 id="orga294585">failed test result return ok/done.</h4>
</div>
<div id="outline-container-orgb6e2324" class="outline-4">
<h4 id="orgb6e2324">flashing dangerous parameter onto the vehicle without testing！</h4>
</div>
<div id="outline-container-org5af5532" class="outline-4">
<h4 id="org5af5532">testing without knowing what is doing (which vehicle is flashing!)</h4>
</div>
<div id="outline-container-org1f98e68" class="outline-4">
<h4 id="org1f98e68">chaotic imports no isort!</h4>
</div>
<div id="outline-container-orgada2a39" class="outline-4">
<h4 id="orgada2a39">everytime huge chaotic code changes</h4>
</div>
<div id="outline-container-orga30b037" class="outline-4">
<h4 id="orga30b037">chaotic documentation</h4>
</div>
<div id="outline-container-org9df4622" class="outline-4">
<h4 id="org9df4622">cannot use directly</h4>
</div>
<div id="outline-container-org0da506c" class="outline-4">
<h4 id="org0da506c">no confirm of changing!</h4>
</div>
<div id="outline-container-org4daf4a0" class="outline-4">
<h4 id="org4daf4a0">no design, no architecture, no production level</h4>
<div class="outline-text-4" id="text-org4daf4a0">
</div>
<ul class="org-ul">
<li><a id="org9ebf13b"></a>code not maintainable<br /></li>
<li><a id="org0c74564"></a>no exception handling<br /></li>
<li><a id="org65f57cc"></a>no timestamp hanlding<br /></li>
<li><a id="orgd4a9a6e"></a>typos everywhere<br /></li>
<li><a id="org1d0b742"></a>not pytest ready<br /></li>
<li><a id="orgf88a63c"></a>false claims<br /></li>
<li><a id="orgb6342ae"></a>naming/api chaotic<br /></li>
<li><a id="org8e17b83"></a>terrible documentation/coding styles (no black, isort etc.)<br /></li>
<li><a id="org3c65690"></a>not familiar with mongodb<br /></li>
</ul>
</div>
<div id="outline-container-org7ce3fbe" class="outline-4">
<h4 id="org7ce3fbe">api design: flashing return error code 3?!</h4>
</div>
<div id="outline-container-org2d53637" class="outline-4">
<h4 id="org2d53637">api unstable: cannot flashing!</h4>
</div>
<div id="outline-container-org83e93f0" class="outline-4">
<h4 id="org83e93f0">todo debug 1000, 1002, empty code {} oss insufficiency</h4>
</div>
<div id="outline-container-orgdde24f7" class="outline-4">
<h4 id="orgdde24f7">todo get &amp; send in duplex mode</h4>
</div>
<div id="outline-container-org2bf7bb4" class="outline-4">
<h4 id="org2bf7bb4">poor response (own code response 2 days!)</h4>
</div>
</div>

<div id="outline-container-orgeedaa37" class="outline-3">
<h3 id="orgeedaa37">fixed url for server?</h3>
</div>
<div id="outline-container-orgfb07473" class="outline-3">
<h3 id="orgfb07473">need fake json data server like jsonplaceholder.typicode.com</h3>
</div>
<div id="outline-container-org9957f65" class="outline-3">
<h3 id="org9957f65">need timestamps</h3>
</div>
<div id="outline-container-org233d440" class="outline-3">
<h3 id="org233d440">streaming requests</h3>
</div>
<div id="outline-container-orga9ae504" class="outline-3">
<h3 id="orga9ae504">session for higher efficiency</h3>
</div>
<div id="outline-container-org2d14fb6" class="outline-3">
<h3 id="org2d14fb6">design goal &#x2013;&gt; understand deviation &#x2013;&gt; need verify &#x2013;&gt; performance checking</h3>
</div>
<div id="outline-container-orge498b3b" class="outline-3">
<h3 id="orge498b3b">todo <b>issues</b> improvements:</h3>
<div class="outline-text-3" id="text-orge498b3b">
</div>
<div id="outline-container-orgbd88373" class="outline-4">
<h4 id="orgbd88373">need streaming interface</h4>
<div class="outline-text-4" id="text-orgbd88373">
</div>
<ul class="org-ul">
<li><a id="orgbd0ae31"></a>with mode switch to turn on and off<br /></li>
<li><a id="orgd14afbd"></a>need full observation based on incessant frames of a full episode<br /></li>
</ul>
</div>
<div id="outline-container-orgc168e3d" class="outline-4">
<h4 id="orgc168e3d">need asynchronous download and upload</h4>
<div class="outline-text-4" id="text-orgc168e3d">
</div>
<ul class="org-ul">
<li><a id="org0eb53ee"></a>usual way of remote interaction to handle delay, interrupt, preemtpion<br /></li>
<li><a id="orgea82e3c"></a>flexible, robust<br /></li>
</ul>
</div>
<div id="outline-container-orgf105fb6" class="outline-4">
<h4 id="orgf105fb6">upload need more status: start/stop/interrupt eos mode,</h4>
</div>
<div id="outline-container-orgea0defb" class="outline-4">
<h4 id="orgea0defb"><b><b>use rpc instead of rest api</b></b></h4>
</div>
</div>
<div id="outline-container-org3d00920" class="outline-3">
<h3 id="org3d00920">product branch</h3>
<div class="outline-text-3" id="text-org3d00920">
<p>
<a href="./20220420093028-veos_adp_plan.html">veos-adp-plan</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org36457bb" class="outline-2">
<h2 id="org36457bb">tbox</h2>
<div class="outline-text-2" id="text-org36457bb">
</div>
<div id="outline-container-org4eec228" class="outline-3">
<h3 id="org4eec228">wiring</h3>
<div class="outline-text-3" id="text-org4eec228">
</div>
<div id="outline-container-orgacd369b" class="outline-4">
<h4 id="orgacd369b">can<sub>activate</sub> one light?</h4>
</div>
<div id="outline-container-org0ba7b59" class="outline-4">
<h4 id="org0ba7b59">no calibration can?</h4>
</div>
</div>
<div id="outline-container-org9222c1b" class="outline-3">
<h3 id="org9222c1b">can<sub>driver</sub><sub>node</sub> rebuild? observation values ok?</h3>
</div>
<div id="outline-container-orgee927db" class="outline-3">
<h3 id="orgee927db">pm 21 rows &#x2013;&gt; 14 rows? row coordinates?</h3>
</div>
<div id="outline-container-org9f468f5" class="outline-3">
<h3 id="org9f468f5">flashing</h3>
<div class="outline-text-3" id="text-org9f468f5">
</div>
<div id="outline-container-org86b5fbb" class="outline-4">
<h4 id="org86b5fbb">upload?</h4>
</div>
<div id="outline-container-orgb5cc6d8" class="outline-4">
<h4 id="orgb5cc6d8">download?</h4>
</div>
<div id="outline-container-org3088fe2" class="outline-4">
<h4 id="org3088fe2">diff on/off? meaning?</h4>
</div>
</div>
</div>
<div id="outline-container-orgf961355" class="outline-2">
<h2 id="orgf961355">cloud</h2>
<div class="outline-text-2" id="text-orgf961355">
</div>
<div id="outline-container-org949ee83" class="outline-3">
<h3 id="org949ee83">task</h3>
<div class="outline-text-3" id="text-org949ee83">
</div>
<div id="outline-container-org5c1a566" class="outline-4">
<h4 id="org5c1a566">pre-requisite</h4>
<div class="outline-text-4" id="text-org5c1a566">
</div>
<ul class="org-ul">
<li><a id="orge05718e"></a>cloud platform test (connection ssh login, python, linux usergroup, docker install, pyenv configuration, ide )<br /></li>
<li><a id="orgd47c315"></a>issue fixing<br /></li>
<li><a id="orge376bdf"></a>dockerfile<br /></li>
<li><a id="orga021a61"></a>mypy<br /></li>
<li><a id="org1912f2b"></a>kubernetes deployment test<br /></li>
<li><a id="org942a2d8"></a>fortinet install and ethernet test, functional test<br /></li>
</ul>
</div>
<div id="outline-container-org62e1685" class="outline-4">
<h4 id="org62e1685">veos deployment (pip pip+git install, mypy, poetry, )</h4>
</div>
<div id="outline-container-org19c70ea" class="outline-4">
<h4 id="org19c70ea">veos functional test (remotecan, data pool)</h4>
</div>
</div>
<div id="outline-container-org8450fce" class="outline-3">
<h3 id="org8450fce">cloud problem</h3>
<div class="outline-text-3" id="text-org8450fce">
</div>
<div id="outline-container-org70b4137" class="outline-4">
<h4 id="org70b4137">connection</h4>
<div class="outline-text-4" id="text-org70b4137">
</div>
<ul class="org-ul">
<li><a id="orgd599884"></a>install, github, apt-source, pytorch, tensorflow, nvidia overall<br /></li>
<li><a id="org1358f4a"></a>internal repo? gitlab.newrizon.work?<br /></li>
<li><a id="org1fbb5d9"></a>install package by copy not working<br /></li>
</ul>
</div>
<div id="outline-container-orgf5598d9" class="outline-4">
<h4 id="orgf5598d9">docker?</h4>
<div class="outline-text-4" id="text-orgf5598d9">
</div>
<ul class="org-ul">
<li><a id="orgcfcbc1a"></a>dockerfile in the project, install?<br /></li>
<li><a id="org475a1b4"></a>dockerfile, （kubernetes interface）， install source/pip<br /></li>
</ul>
</div>
<div id="outline-container-org02b7a43" class="outline-4">
<h4 id="org02b7a43">baiduyun account, profile setting</h4>
<div class="outline-text-4" id="text-org02b7a43">
</div>
<ul class="org-ul">
<li><a id="orga42fb7a"></a>ssh<br /></li>
<li><a id="orgc34a39d"></a>options: pip<br /></li>
<li><a id="org11dc678"></a>dns, vpn /ssh reverse tunnel?<br /></li>
<li><a id="org2678fad"></a>pyenv?<br /></li>
</ul>
</div>
<div id="outline-container-org3391173" class="outline-4">
<h4 id="org3391173">pip</h4>
<div class="outline-text-4" id="text-org3391173">
</div>
<ul class="org-ul">
<li><a id="org01efa11"></a>git+<a href="https://%24%7B%7D:%24%7B%7Dgitlab@newrizon.work/ai/drl-carla-manual.git@%7Brealese2">https://%24%7B%7D:%24%7B%7Dgitlab@newrizon.work/ai/drl-carla-manual.git@%7Brealese2</a>}<br /></li>
<li><a id="orgbc407c0"></a>priviate pip repo<br /></li>
</ul>
</div>
<div id="outline-container-orgeee07d5" class="outline-4">
<h4 id="orgeee07d5">not doing own duties</h4>
<div class="outline-text-4" id="text-orgeee07d5">
</div>
<ul class="org-ul">
<li><a id="org1c5f00c"></a>own container build issue<br /></li>
<li><a id="org6e88a7f"></a>very old git (even in docker reinstalled)<br /></li>
<li><a id="orgbd76bde"></a>not following instructions, deliberately asking irrelevant questions<br /></li>
<li><a id="org6d79623"></a>no testing, all integration test by apps!<br />
<ul class="org-ul">
<li><a id="orgda3790e"></a>all issues found by apps, not integration test, no module test<br /></li>
<li><a id="orgcea5fb0"></a>issues found, no progress<br /></li>
</ul>
</li>
