content/roam/20220406134513-veos_adp.org
**** deliberately change interfaces while adding features
***** rocketmq
****** why would app contain cluster stuff?
***** reomotecan parallel processing
**** no design review
***** poor design: single machine/clusters. why?
***** frequent changes of interfaces
**** way of development
***** exchange of code not functionality
*** vbu software not confirmed
*** instruction? handbook? (baidubce?, github? pytorch!)
*** least surprise? (low efficiency, poor maturity)
**** user account management, strange account blocking
**** unstable access to outside network (pip, )
**** poor connection (github intermittent, 50k top)
**** inexplicable restore
**** partition? 20g
**** does copy (not install) really work?
** database
*** [[./20220829110049-data_warehouse.org][data warehouse]]
*** time series support for databse (timestamp, efficient indexing)
**** timestamp
***** indexing (searching)
***** random sample method
**** metadata:
***** vin
***** unit time length
***** sample frequency
***** location
*** *automatic choose collection based on meta data*
*** serialization support for pandas dataframe and numpy array, python objects, compression
*** data versioning, snapshots, chunking, ttl
*** update records with new features (mongodb 6.0, for mongodb<6.0 only appending)
*** tracking changes over time
*** user, user library account management
*** version-, tick-, chunkstore, bsonstore
*** working with large data, lazy loading
*** prevent unindexed/unsharded collections
*** thread safety?
*** exception handling (collection)
*** apache arrow for in memory analytics (pymongoarrow)
*** multiple database with different unit lengths.
*** no configures in the database document/ in application configuration
*** maintaining, porting, searching, indexing, compatibility?
*** variant metadata
*** todo data warelake design
** dvc [[./20220511155146-ml_version_control.org][ml-version-control]]
** truss server for prediction
** basic function
** saftety function
** algorithms verficatioin
* safety
** communication (cybersecurity, data safety)
** actor
** observation (data safety)
* test issue
** design sucks, cannot meet requirements
** quality sucks, oss not sufficient --> intest interference? why?
** database drops, ridiculous
** deadend everywhere
** not telling truth
** no test before application, alarming!
*** all problems on the final applications
*** persistency, availability
*** not knowning service is available! everyday checking!!!
*** cannot continue test
** firmware version, no one cares, which one should be used?!
*** alarmed but no response
