docs/roam/20220406134513-veos_adp.html
<li><a id="org92002ef"></a>deliberately change interfaces while adding features<br />
<ul class="org-ul">
<li><a id="orgab044bd"></a>rocketmq<br />
<ul class="org-ul">
<li><a id="org7ad4e69"></a>why would app contain cluster stuff?<br /></li>
</ul>
</li>
<li><a id="orgacd0349"></a>reomotecan parallel processing<br /></li>
</ul>
</li>
<li><a id="org9e7e6d2"></a>no design review<br />
<ul class="org-ul">
<li><a id="org0499c98"></a>poor design: single machine/clusters. why?<br /></li>
<li><a id="org0f12042"></a>frequent changes of interfaces<br /></li>
</ul>
</li>
<li><a id="org26e5d49"></a>way of development<br />
<ul class="org-ul">
<li><a id="orge02a4f3"></a>exchange of code not functionality<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org89f3691" class="outline-4">
<h4 id="org89f3691">vbu software not confirmed</h4>
</div>
<div id="outline-container-orgcdc2dac" class="outline-4">
<h4 id="orgcdc2dac">instruction? handbook? (baidubce?, github? pytorch!)</h4>
</div>
<div id="outline-container-orgc1fe9ea" class="outline-4">
<h4 id="orgc1fe9ea">least surprise? (low efficiency, poor maturity)</h4>
<div class="outline-text-4" id="text-orgc1fe9ea">
</div>
<ul class="org-ul">
<li><a id="org8ea82f6"></a>user account management, strange account blocking<br /></li>
<li><a id="org6e2f9c6"></a>unstable access to outside network (pip, )<br /></li>
<li><a id="org57feebb"></a>poor connection (github intermittent, 50k top)<br /></li>
<li><a id="org546b63a"></a>inexplicable restore<br /></li>
<li><a id="org676de5b"></a>partition? 20g<br /></li>
<li><a id="org3b7f05f"></a>does copy (not install) really work?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgc88839e" class="outline-3">
<h3 id="orgc88839e">database</h3>
<div class="outline-text-3" id="text-orgc88839e">
</div>
<div id="outline-container-org530312d" class="outline-4">
<h4 id="org530312d"><a href="./20220829110049-data_warehouse.html">data warehouse</a></h4>
</div>
<div id="outline-container-orge9e0e97" class="outline-4">
<h4 id="orge9e0e97">time series support for databse (timestamp, efficient indexing)</h4>
<div class="outline-text-4" id="text-orge9e0e97">
</div>
<ul class="org-ul">
<li><a id="org9913140"></a>timestamp<br />
<ul class="org-ul">
<li><a id="org4b6d8c8"></a>indexing (searching)<br /></li>
<li><a id="orgfb254ee"></a>random sample method<br /></li>
</ul>
</li>
<li><a id="orgb337df3"></a>metadata:<br />
<ul class="org-ul">
<li><a id="orgd4fa2a1"></a>vin<br /></li>
<li><a id="org21e5e70"></a>unit time length<br /></li>
<li><a id="org21dc714"></a>sample frequency<br /></li>
<li><a id="org4a42b5d"></a>location<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org3b70589" class="outline-4">
<h4 id="org3b70589"><b>automatic choose collection based on meta data</b></h4>
</div>
<div id="outline-container-org661cdd2" class="outline-4">
<h4 id="org661cdd2">serialization support for pandas dataframe and numpy array, python objects, compression</h4>
</div>
<div id="outline-container-orgeb9b6c8" class="outline-4">
<h4 id="orgeb9b6c8">data versioning, snapshots, chunking, ttl</h4>
</div>
<div id="outline-container-org591b589" class="outline-4">
<h4 id="org591b589">update records with new features (mongodb 6.0, for mongodb&lt;6.0 only appending)</h4>
</div>
<div id="outline-container-org224bdcc" class="outline-4">
<h4 id="org224bdcc">tracking changes over time</h4>
</div>
<div id="outline-container-orgecff99e" class="outline-4">
<h4 id="orgecff99e">user, user library account management</h4>
</div>
<div id="outline-container-org5fe8a5a" class="outline-4">
<h4 id="org5fe8a5a">version-, tick-, chunkstore, bsonstore</h4>
</div>
<div id="outline-container-org1a3273d" class="outline-4">
<h4 id="org1a3273d">working with large data, lazy loading</h4>
</div>
<div id="outline-container-org5a3037b" class="outline-4">
<h4 id="org5a3037b">prevent unindexed/unsharded collections</h4>
</div>
<div id="outline-container-org8e0d574" class="outline-4">
<h4 id="org8e0d574">thread safety?</h4>
</div>
<div id="outline-container-org0639c68" class="outline-4">
<h4 id="org0639c68">exception handling (collection)</h4>
</div>
<div id="outline-container-orgddba7ad" class="outline-4">
<h4 id="orgddba7ad">apache arrow for in memory analytics (pymongoarrow)</h4>
</div>
<div id="outline-container-org8d03621" class="outline-4">
<h4 id="org8d03621">multiple database with different unit lengths.</h4>
</div>
<div id="outline-container-orgc8a815d" class="outline-4">
<h4 id="orgc8a815d">no configures in the database document/ in application configuration</h4>
</div>
<div id="outline-container-orgd0c56b0" class="outline-4">
<h4 id="orgd0c56b0">maintaining, porting, searching, indexing, compatibility?</h4>
</div>
<div id="outline-container-org7172352" class="outline-4">
<h4 id="org7172352">variant metadata</h4>
</div>
<div id="outline-container-orga27060f" class="outline-4">
<h4 id="orga27060f">todo data warelake design</h4>
</div>
</div>
<div id="outline-container-org1231945" class="outline-3">
<h3 id="org1231945">dvc <a href="./20220511155146-ml_version_control.html">ml-version-control</a></h3>
</div>
<div id="outline-container-org5ebd0fe" class="outline-3">
<h3 id="org5ebd0fe">truss server for prediction</h3>
</div>
<div id="outline-container-orgb25764d" class="outline-3">
<h3 id="orgb25764d">basic function</h3>
</div>
<div id="outline-container-orgeadd3f1" class="outline-3">
<h3 id="orgeadd3f1">saftety function</h3>
</div>
<div id="outline-container-org77c94b5" class="outline-3">
<h3 id="org77c94b5">algorithms verficatioin</h3>
</div>
</div>
<div id="outline-container-org164ba03" class="outline-2">
<h2 id="org164ba03">safety</h2>
<div class="outline-text-2" id="text-org164ba03">
</div>
<div id="outline-container-org25e46bd" class="outline-3">
<h3 id="org25e46bd">communication (cybersecurity, data safety)</h3>
</div>
<div id="outline-container-orgaa96d62" class="outline-3">
<h3 id="orgaa96d62">actor</h3>
</div>
<div id="outline-container-org95c8fe6" class="outline-3">
<h3 id="org95c8fe6">observation (data safety)</h3>
</div>
</div>
<div id="outline-container-orgab1aa0c" class="outline-2">
<h2 id="orgab1aa0c">test issue</h2>
<div class="outline-text-2" id="text-orgab1aa0c">
</div>
<div id="outline-container-orgdba0904" class="outline-3">
<h3 id="orgdba0904">design sucks, cannot meet requirements</h3>
</div>
<div id="outline-container-orgc4f250b" class="outline-3">
<h3 id="orgc4f250b">quality sucks, oss not sufficient &#x2013;&gt; intest interference? why?</h3>
</div>
<div id="outline-container-orgc4d8348" class="outline-3">
<h3 id="orgc4d8348">database drops, ridiculous</h3>
</div>
<div id="outline-container-org1e5a129" class="outline-3">
<h3 id="org1e5a129">deadend everywhere</h3>
</div>
<div id="outline-container-org43a6d11" class="outline-3">
<h3 id="org43a6d11">not telling truth</h3>
</div>
<div id="outline-container-org26ced23" class="outline-3">
<h3 id="org26ced23">no test before application, alarming!</h3>
<div class="outline-text-3" id="text-org26ced23">
</div>
<div id="outline-container-org604339f" class="outline-4">
<h4 id="org604339f">all problems on the final applications</h4>
</div>
<div id="outline-container-org99d139c" class="outline-4">
<h4 id="org99d139c">persistency, availability</h4>
</div>
<div id="outline-container-org4a01966" class="outline-4">
<h4 id="org4a01966">not knowning service is available! everyday checking!!!</h4>
</div>
<div id="outline-container-org21be839" class="outline-4">
<h4 id="org21be839">cannot continue test</h4>
</div>
</div>
<div id="outline-container-orgd7ab54e" class="outline-3">
<h3 id="orgd7ab54e">firmware version, no one cares, which one should be used?!</h3>
<div class="outline-text-3" id="text-orgd7ab54e">
</div>
<div id="outline-container-orge464db4" class="outline-4">
<h4 id="orge464db4">alarmed but no response</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
